slides.org
#+TITLE: Worshop on Emacs, Org-Mode, and Reproducible Research
#+AUTHOR: Zheng Tian
#+EMAIL: zngtian@gmail.com
#+DATE: [2017-02-09 Thu]
#+OPTIONS: H:2 num:nil toc:nil
#+PROPERTY: header-args:R  :session *R*

#+STARTUP: beamer
#+OPTIONS: toc:1 H:2
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [presentation]
#+BEAMER_THEME: AnnArbor
#+BEAMER_COLOR_THEME:
#+COLUMNS: %45ITEM %10BEAMER_env(Env) %10BEAMER_act(Act) %4BEAMER_col(Col) %8BEAMER_opt(Opt)
#+PROPERTY: BEAMER_col_ALL 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 0.0 :ETC

#+OPTIONS: reveal_center:t reveal_progress:t reveal_history:nil reveal_control:t
#+OPTIONS: reveal_rolling_links:t reveal_keyboard:t reveal_overview:t num:nil
#+OPTIONS: reveal_width:1000 reveal_height:800
#+REVEAL_MARGIN: 0.1
#+REVEAL_MIN_SCALE: 0.5
#+REVEAL_MAX_SCALE: 2.5
#+REVEAL_TRANS: linear
#+REVEAL_THEME: white
#+REVEAL_HLEVEL: 2
#+REVEAL_PLUGINS: (highlight notes zoom menu)
# #+REVEAL_INIT_SCRIPT: { src: 'file:///Users/ztian/gitDownloads/reveal.js/plugin/reveal.js-menu/menu.js' } ], menu: {markers: true}
#+REVEAL_MATHJAX_URL: file:///Users/ztian/gitDownloads/MathJax/MathJax.js?config=TeX-AMS-MML_HTMLorMML


* Introduction

* Emacs

** What is Emacs? A text editor

GNU Emacs is a free, portable, extensible text editor.

- Free: Open source, freely copyable and redistributable.
- Portable: Run on many machines under different operating systems.
- Extensible: Customizable for all aspects, many contributed packages,
  and add new functions via Elisp.

** Emacs is beyond a text editor

- Emacs is an IDE for editing and executing code in programming
  languages, like R, python, MATLAB, etc.
- Emacs is an operating system, easily managing files and folders
  within a dired-directory interface.
- Emacs can do spell checking, reading news, checking and sending
  emails, etc., through plenty of contributed packages.
- Most importantly, Emacs enable researchers to manage research
  project, take notes, and write dynamic documentation.
