slides.tex
% Created 2017-01-30 Mon 22:53
% Intended LaTeX compiler: pdflatex
\documentclass[presentation]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usetheme{AnnArbor}
\usecolortheme{}
\author{Zheng Tian}
\date{\textit{[2017-02-09 Thu]}}
\title{Worshop on Emacs, Org-Mode, and Reproducible Research}
\hypersetup{
 pdfauthor={Zheng Tian},
 pdftitle={Worshop on Emacs, Org-Mode, and Reproducible Research},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.1.1 (Org mode 9.0.3)},
 pdflang={English}}
\begin{document}

\maketitle
\begin{frame}{Outline}
\setcounter{tocdepth}{1}
\tableofcontents
\end{frame}



\section*{Introduction}
\label{sec:org1529094}

\section*{Emacs}
\label{sec:orgf8ae889}

\begin{frame}[label={sec:orga3db2e1}]{What is Emacs? A text editor}
GNU Emacs is a free, portable, extensible text editor.

\begin{itemize}
\item Free: Open source, freely copyable and redistributable.
\item Portable: Run on many machines under different operating systems.
\item Extensible: Customizable for all aspects, many contributed packages,
and add new functions via Elisp.
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgf6c6fa5}]{Emacs is beyond a text editor}
\begin{itemize}
\item Emacs is an IDE for editing and executing code in programming
languages, like R, python, MATLAB, etc.
\item Emacs is an operating system, easily managing files and folders
within a dired-directory interface.
\item Emacs can do spell checking, reading news, checking and sending
emails, etc., through plenty of contributed packages.
\item Most importantly, Emacs enable researchers to manage research
project, take notes, and write dynamic documentation.
\end{itemize}
\end{frame}
\end{document}